УТ_для_edt.РасширениеСмарт/src/Documents/ЗаявкаНаРасходованиеДенежныхСредств/ЗаявкаНаРасходованиеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КтоЗаявил</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e8d0c39e-e0f3-4ec3-82b4-e50b2711f842">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="36cb4838-c436-4bf0-9c71-bb079fed4041">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="e9f9e8b4-0ef2-4893-a052-aed6ee5182e3">
    <name>смартОшибкиВРеквизитах</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e263d115-ae34-4efe-a483-b809d8ed54ee">
      <name>СинонимРеквизита</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ccf91d05-c2b0-4cf8-b0df-9d0f0962dcd8">
      <name>ОписаниеОшибки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="cbfe7c8f-54c1-43a8-ad59-1e976148c661">
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="730b12c8-52ae-454d-9a3d-98ac29a5bcf3">
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Documents/ЗаявкаНаРасходованиеДенежныхСредств/Forms/смарт_ФормаОшибок/Module.bsl
//++ смарт:ПА #815 11.12.2021 20:11:10
&НаКлиенте
Процедура ОК(Команда)
    
    Если ЭтаФорма.ТолькоПросмотр Тогда
        Закрыть();
    Иначе
        МассивСтрок=Новый Массив;
        Для каждого стр Из смартОшибкиВРеквизитах Цикл
            МассивСтрок.Добавить(Новый Структура("СинонимРеквизита,ОписаниеОшибки",стр.СинонимРеквизита,стр.ОписаниеОшибки)); 
        КонецЦикла; 
        
        Закрыть(МассивСтрок);
    КонецЕсли;  
    
КонецПроцедуры //-- смарт:ПА #815 11.12.2021 20:11:10


//++ смарт:ПА #815 10.12.2021 19:43:56
&НаКлиенте
Процедура Отмена(Команда)
    
    Модифицированность = Ложь;
	Закрыть();

КонецПроцедуры //-- смарт:ПА #815 10.12.2021 19:43:56

//++ смарт:ПА #815 10.12.2021 17:34:32
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
        Возврат;
    КонецЕсли;
    
    // смартОшибкиВРеквизитах.Загрузить(Параметры.Ключ.смартОшибкиВРеквизитах.Выгрузить());
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ТЗТекущая.СинонимРеквизита КАК СинонимРеквизита,
    |	ТЗТекущая.ОписаниеОшибки КАК ОписаниеОшибки
    |ПОМЕСТИТЬ ВременнаяТЗ
    |ИЗ
    |	&ТЗТекущая КАК ТЗТекущая
    |;
    
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	смартПредопределенныеЗначенияЗначения.Значение КАК СинонимРеквизита,
    |	ВременнаяТЗ.ОписаниеОшибки КАК ОписаниеОшибки
    |ИЗ
    |	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТЗ КАК ВременнаяТЗ
    |		ПО (ВременнаяТЗ.СинонимРеквизита = смартПредопределенныеЗначенияЗначения.Значение)
    |ГДЕ
    |	смартПредопределенныеЗначенияЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.смартПредопределенныеЗначения.СинонимыПолейЗаявки)";
    
    Запрос.УстановитьПараметр("ТЗТекущая",Параметры.Ключ.смартОшибкиВРеквизитах.Выгрузить());
    
    РезультатЗапроса = Запрос.Выполнить();
    Если НЕ РезультатЗапроса.Пустой() Тогда
        смартОшибкиВРеквизитах.Загрузить(РезультатЗапроса.Выгрузить());
    КонецЕсли; 
    //
  //  ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
  //  
  //  Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
  //      Если Не смартОшибкиВРеквизитах.Количество() Тогда
  //          НовСтрокаТЧ=смартОшибкиВРеквизитах.Добавить();
  //          НовСтрокаТЧ.СинонимРеквизита=ВыборкаДетальныеЗаписи.Значение;
  //      КонецЕсли; 
  //      Для каждого стр Из смартОшибкиВРеквизитах Цикл
  //          Если Стр.СинонимРеквизита=ВыборкаДетальныеЗаписи.Значение Тогда
  //          иначе
  //              НовСтрокаТЧ=смартОшибкиВРеквизитах.Добавить();
  //              НовСтрокаТЧ.СинонимРеквизита=ВыборкаДетальныеЗаписи.Значение;
  //          КонецЕсли; 
  //      КонецЦикла; 
  //  КонецЦикла;
  //     
КонецПроцедуры //-- смарт:ПА #815 10.12.2021 17:34:32
